Revit 2027 API
View.GetOrderedFilters Method
 Gets the filters applied to the view in the order they are applied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetOrderedFilters()
Public Function GetOrderedFilters As IList(Of ElementId)
public:
IList<ElementId^>^ GetOrderedFilters()
member GetOrderedFilters : unit -> IList<ElementId>
Return Value
IList<ElementId>
 The ElementIds of the Filters.
Exceptions
Exception | Condition
InvalidOperationException |  The element "this View" does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace